Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Menu_Edit_InsertFile.Text
source: Insert File Contents...
ar: إدراج محتويات ملف...
cs: Vložit obsah souboru...
de: Dateiinhalt einfügen...
el: Εισαγωγή περιεχομένων αρχείου...
es: Insertar contenido de archivo...
fa: درج محتوای فایل...
fr: Insérer le contenu d'un fichier...
hu: Fájl tartalmának beszúrása...
id: Sisipkan Isi File...
it: Inserisci contenuto file...
ja: ファイルの内容を挿入(F)...
ko: 파일 내용 삽입(F)...
pl: Wstaw zawartość pliku...
pt: Inserir conteúdo de arquivo...
ro: Inserare conținut fișier...
ru: Вставить содержимое файла...
th: แทรกเนื้อหาไฟล์(F)...
tr: Dosya İçeriği Ekle...
uk: Вставити вміст файлу...
vi: Chèn Nội dung Tệp...
zh_hans: 插入文件内容(F)...
zh_hant: 插入檔案內容(F)...

# Menu_Edit_InsertFile.AccessKey
source: F
ar: م
cs: S
de: D
el: Χ
es: N
fa: ف
fr: N
hu: R
pl: L
pt: Q
ru: Ф
tr: D
uk: Ф
vi: U

# Menu_Edit_Fill.Text
source: Fill...
ar: تعبئة...
cs: Vyplnit...
de: Füllen...
el: Συμπλήρωση...
es: Rellenar...
fa: پر کردن...
fr: Remplir...
hu: Kitöltés...
id: Isi...
it: Riempi...
ja: 塗りつぶし(L)...
ko: 채우기(L)...
pl: Wypełnij...
pt: Preencher...
ro: Umplere...
ru: Заполнить...
th: เติม(L)...
tr: Doldur...
uk: Заповнити...
vi: Điền...
zh_hans: 填充(L)...
zh_hant: 填滿(L)...

# Menu_Edit_Fill.AccessKey
source: L
ar: ئ
cs: Y
de: F
el: Σ
es: F
fa: پ
fr: E
hu: É
id: I
it: M
pl: Y
pt: P
ro: B
ru: Л
uk: Н
vi: E

# Menu_Edit_Resize.Text
source: Change File Size...
ar: تغيير حجم الملف...
cs: Změnit velikost souboru...
de: Dateigröße ändern...
el: Αλλαγή μεγέθους αρχείου...
es: Cambiar tamaño del archivo...
fa: تغییر اندازهٔ فایل...
fr: Modifier la taille du fichier...
hu: Fájlméret módosítása...
id: Ubah Ukuran File...
it: Cambia dimensione file...
ja: ファイルサイズの変更(Z)...
ko: 파일 크기 변경(Z)...
pl: Zmień rozmiar pliku...
pt: Alterar tamanho do arquivo...
ro: Modificare dimensiune fișier...
ru: Изменить размер файла...
th: เปลี่ยนขนาดไฟล์(Z)...
tr: Dosya Boyutunu Değiştir...
uk: Змінити розмір файлу...
vi: Đổi Kích thước Tệp...
zh_hans: 更改文件大小(Z)...
zh_hant: 變更檔案大小(Z)...

# Menu_Edit_Resize.AccessKey
source: Z
ar: غ
cs: M
de: T
el: Θ
es: M
fa: ز
fr: M
hu: E
id: E
it: D
pl: M
pt: M
ro: Ș
ru: Е
tr: U
uk: Р
vi: K

# Menu_Edit_Truncate.Text
source: Truncate at Cursor
ar: اقتطاع عند المؤشر
cs: Zkrátit u kurzoru
de: Am Cursor abschneiden
el: Περικοπή στον δρομέα
es: Truncar en el cursor
fa: کوتاه کردن در مکان‌نما
fr: Tronquer au curseur
hu: Csonkítás a kurzornál
id: Potong di Kursor
it: Tronca al cursore
ja: カーソル位置で切り詰める(N)
ko: 커서 위치에서 자르기(N)
pl: Obetnij od kursora
pt: Truncar no cursor
ro: Trunchiere la cursor
ru: Обрезать по курсору
th: ตัดท้ายที่เคอร์เซอร์(N)
tr: İmleçte Kırp
uk: Обрізати за курсором
vi: Cắt bớt tại Con trỏ
zh_hans: 在光标处截断(N)
zh_hant: 在游標處截斷(N)

# Menu_Edit_Truncate.AccessKey
source: N
ar: ش
cs: U
de: C
el: Ο
es: U
fa: ک
fr: Q
hu: C
id: K
it: U
pl: E
pt: U
ro: T
ru: У
tr: R
uk: О
vi: I

# Menu_Edit_ReadOnly.Text
source: Read-only
ar: للقراءة فقط
cs: Jen pro čtení
de: Schreibgeschützt
el: Μόνο για ανάγνωση
es: Solo lectura
fa: فقط خواندنی
fr: Lecture seule
hu: Írásvédett
id: Baca-saja
it: Sola lettura
ja: 読み取り専用(D)
ko: 읽기 전용(D)
pl: Tylko do odczytu
pt: Somente leitura
ro: Doar în citire
ru: Только чтение
th: อ่านอย่างเดียว(D)
tr: Salt Okunur
uk: Лише читання
vi: Chỉ đọc
zh_hans: 只读(D)
zh_hant: 唯讀(D)

# Menu_Edit_ReadOnly.AccessKey
source: D
ar: ف
cs: T
de: S
el: Η
es: H
fa: خ
fr: G
id: C
it: G
pt: F
ro: Î
ru: Ч
tr: S
uk: Ч
vi: O

# Dialog_ErrorAt
source: (at character {0})
ar: (عند الحرف {0})
cs: (u znaku {0})
de: (bei Zeichen {0})
el: (στον χαρακτήρα {0})
es: (en el carácter {0})
fa: (در نویسهٔ {0})
fr: (au caractère {0})
hu: ({0}. karakternél)
id: (pada karakter {0})
it: (al carattere {0})
ja: ({0} 文字目)
ko: ({0}번째 문자)
pl: (przy znaku {0})
pt: (no caractere {0})
ro: (la caracterul {0})
ru: (символ {0})
th: (ที่อักขระ {0})
tr: ({0}. karakterde)
uk: (символ {0})
vi: (tại ký tự {0})
zh_hans: （第 {0} 个字符处）
zh_hant: （第 {0} 個字元）

# Dialog_Preview
source: Preview: {0}
ar: معاينة: {0}
cs: Náhled: {0}
de: Vorschau: {0}
el: Προεπισκόπηση: {0}
es: Vista previa: {0}
fa: پیش‌نمایش: {0}
fr: Aperçu : {0}
hu: Előnézet: {0}
id: Pratinjau: {0}
it: Anteprima: {0}
ja: プレビュー: {0}
ko: 미리 보기: {0}
pl: Podgląd: {0}
pt: Visualização: {0}
ro: Previzualizare: {0}
ru: Предварительный просмотр: {0}
th: ตัวอย่าง: {0}
tr: Önizleme: {0}
uk: Попередній перегляд: {0}
vi: Xem trước: {0}
zh_hans: 预览：{0}
zh_hant: 預覽：{0}

# ReadOnly_AllowEdit
source: Allow editing
ar: السماح بالتحرير
cs: Povolit úpravy
de: Bearbeitung zulassen
el: Να επιτρέπεται η επεξεργασία
es: Permitir edición
fa: اجازهٔ ویرایش
fr: Autoriser la modification
hu: Szerkesztés engedélyezése
id: Izinkan pengeditan
it: Consenti modifica
ja: 編集を許可する
ko: 편집 허용
pl: Zezwól na edycję
pt: Permitir edição
ro: Permitere editare
ru: Разрешить редактирование
th: อนุญาตการแก้ไข
tr: Düzenlemeye izin ver
uk: Дозволити редагування
vi: Cho phép chỉnh sửa
zh_hans: 允许编辑
zh_hant: 允許編輯

# ReadOnly_Confirm_Title
source: Allow editing?
ar: هل تريد السماح بالتحرير؟
cs: Povolit úpravy?
de: Bearbeitung zulassen?
el: Να επιτρέπεται η επεξεργασία;
es: ¿Permitir la edición?
fa: اجازهٔ ویرایش داده شود؟
fr: Autoriser la modification ?
hu: Engedélyezi a szerkesztést?
id: Izinkan pengeditan?
it: Consentire la modifica?
ja: 編集を許可しますか?
ko: 편집을 허용하시겠습니까?
pl: Czy zezwolić na edycję?
pt: Permitir edição?
ro: Permiteți editarea?
ru: Разрешить редактирование?
th: อนุญาตการแก้ไขหรือไม่
tr: Düzenlemeye izin verilsin mi?
uk: Дозволити редагування?
vi: Cho phép chỉnh sửa?
zh_hans: 是否允许编辑？
zh_hant: 要允許編輯嗎？

# ReadOnly_Confirm_OpenedReadOnly
source: This document was opened read-only. Allow editing? The file is opened for writing only when you save.
ar: تم فتح هذا المستند للقراءة فقط. هل تريد السماح بالتحرير؟ لا يُفتح الملف للكتابة إلا عند الحفظ.
cs: Tento dokument byl otevřen jen pro čtení. Povolit úpravy? Soubor se otevře pro zápis až při uložení.
de: Dieses Dokument wurde schreibgeschützt geöffnet. Bearbeitung zulassen? Die Datei wird erst beim Speichern zum Schreiben geöffnet.
el: Αυτό το έγγραφο άνοιξε μόνο για ανάγνωση. Να επιτρέπεται η επεξεργασία; Το αρχείο ανοίγει για εγγραφή μόνο όταν το αποθηκεύετε.
es: Este documento se abrió como de solo lectura. ¿Permitir la edición? El archivo solo se abre para escritura al guardar.
fa: این سند به‌صورت فقط خواندنی باز شده است. اجازهٔ ویرایش داده شود؟ فایل فقط هنگام ذخیره برای نوشتن باز می‌شود.
fr: Ce document a été ouvert en lecture seule. Autoriser la modification ? Le fichier n'est ouvert en écriture qu'au moment de l'enregistrement.
hu: Ez a dokumentum írásvédetten lett megnyitva. Engedélyezi a szerkesztést? A fájl csak mentéskor nyílik meg írásra.
id: Dokumen ini dibuka sebagai baca-saja. Izinkan pengeditan? File dibuka untuk penulisan hanya saat Anda menyimpan.
it: Questo documento è stato aperto in sola lettura. Consentire la modifica? Il file viene aperto in scrittura solo quando salvi.
ja: このドキュメントは読み取り専用で開きました。編集を許可しますか? ファイルに書き込むのは保存するときだけです。
ko: 이 문서는 읽기 전용으로 열었습니다. 편집을 허용하시겠습니까? 파일은 저장할 때만 쓰기용으로 열립니다.
pl: Ten dokument został otwarty tylko do odczytu. Czy zezwolić na edycję? Plik zostanie otwarty do zapisu dopiero przy zapisywaniu.
pt: Este documento foi aberto como somente leitura. Permitir edição? O arquivo é aberto para gravação somente quando você salva.
ro: Acest document a fost deschis doar în citire. Permiteți editarea? Fișierul este deschis pentru scriere doar la salvare.
ru: Этот документ открыт только для чтения. Разрешить редактирование? Файл будет открыт для записи только при сохранении.
th: เอกสารนี้ถูกเปิดแบบอ่านอย่างเดียว อนุญาตการแก้ไขหรือไม่ ไฟล์จะถูกเปิดเพื่อเขียนเฉพาะเมื่อคุณบันทึก
tr: Bu belge salt okunur olarak açıldı. Düzenlemeye izin verilsin mi? Dosya yalnızca kaydettiğinizde yazmak için açılır.
uk: Цей документ відкрито лише для читання. Дозволити редагування? Файл буде відкрито для запису лише під час збереження.
vi: Tài liệu này được mở ở chế độ chỉ đọc. Cho phép chỉnh sửa? Tệp chỉ được mở để ghi khi bạn lưu.
zh_hans: 此文档以只读方式打开。是否允许编辑？仅在保存时才会以写入方式打开文件。
zh_hant: 此文件是以唯讀方式開啟。要允許編輯嗎？只有在儲存時才會以寫入模式開啟檔案。

# ReadOnly_Confirm_FileAttribute
source: This file has the read-only attribute. If you allow editing, the attribute is removed when you save.
ar: لهذا الملف سمة القراءة فقط. إذا سمحت بالتحرير، فستتم إزالة السمة عند الحفظ.
cs: Tento soubor má atribut jen pro čtení. Pokud povolíte úpravy, atribut se při uložení odebere.
de: Diese Datei hat das Attribut „Schreibgeschützt“. Wenn Sie die Bearbeitung zulassen, wird das Attribut beim Speichern entfernt.
el: Αυτό το αρχείο έχει το χαρακτηριστικό "μόνο για ανάγνωση". Αν επιτρέψετε την επεξεργασία, το χαρακτηριστικό καταργείται κατά την αποθήκευση.
es: Este archivo tiene el atributo de solo lectura. Si permites la edición, el atributo se quitará al guardar.
fa: این فایل ویژگی فقط خواندنی دارد. اگر اجازهٔ ویرایش بدهید، این ویژگی هنگام ذخیره برداشته می‌شود.
fr: Ce fichier possède l'attribut lecture seule. Si vous autorisez la modification, l'attribut sera supprimé lors de l'enregistrement.
hu: Ennek a fájlnak írásvédett attribútuma van. Ha engedélyezi a szerkesztést, az attribútum mentéskor törlődik.
id: File ini memiliki atribut baca-saja. Jika Anda mengizinkan pengeditan, atribut tersebut dihapus saat Anda menyimpan.
it: Questo file ha l'attributo di sola lettura. Se consenti la modifica, l'attributo viene rimosso al salvataggio.
ja: このファイルには読み取り専用属性があります。編集を許可すると、保存するときに属性を外します。
ko: 이 파일에는 읽기 전용 특성이 있습니다. 편집을 허용하면 저장할 때 특성이 제거됩니다.
pl: Ten plik ma atrybut tylko do odczytu. Jeśli zezwolisz na edycję, atrybut zostanie usunięty przy zapisywaniu.
pt: Este arquivo tem o atributo somente leitura. Se você permitir a edição, o atributo será removido ao salvar.
ro: Acest fișier are atributul doar în citire. Dacă permiteți editarea, atributul este eliminat la salvare.
ru: У этого файла есть атрибут «Только чтение». Если разрешить редактирование, атрибут будет снят при сохранении.
th: ไฟล์นี้มีแอตทริบิวต์อ่านอย่างเดียว หากคุณอนุญาตการแก้ไข แอตทริบิวต์จะถูกเอาออกเมื่อคุณบันทึก
tr: Bu dosyanın salt okunur özniteliği var. Düzenlemeye izin verirseniz kaydettiğinizde öznitelik kaldırılır.
uk: Цей файл має атрибут «Лише читання». Якщо дозволити редагування, атрибут буде знято під час збереження.
vi: Tệp này có thuộc tính chỉ đọc. Nếu bạn cho phép chỉnh sửa, thuộc tính sẽ được gỡ bỏ khi bạn lưu.
zh_hans: 此文件具有只读属性。如果允许编辑，保存时将移除该属性。
zh_hant: 此檔案具有唯讀屬性。如果允許編輯，儲存時會移除此屬性。

# ReadOnly_Confirm_AccessDenied
source: You may not have permission to write to this file. Try to allow editing anyway?
ar: قد لا يكون لديك إذن بالكتابة في هذا الملف. هل تريد محاولة السماح بالتحرير على أي حال؟
cs: Možná nemáte oprávnění k zápisu do tohoto souboru. Přesto zkusit povolit úpravy?
de: Möglicherweise haben Sie keine Schreibberechtigung für diese Datei. Trotzdem versuchen, die Bearbeitung zuzulassen?
el: Ενδέχεται να μην έχετε δικαίωμα εγγραφής σε αυτό το αρχείο. Να γίνει προσπάθεια να επιτραπεί η επεξεργασία;
es: Es posible que no tengas permiso para escribir en este archivo. ¿Intentar permitir la edición de todos modos?
fa: ممکن است اجازهٔ نوشتن در این فایل را نداشته باشید. با این حال اجازهٔ ویرایش امتحان شود؟
fr: Vous n'avez peut-être pas l'autorisation d'écrire dans ce fichier. Essayer quand même d'autoriser la modification ?
hu: Lehet, hogy nincs engedélye a fájl írására. Megpróbálja ennek ellenére engedélyezni a szerkesztést?
id: Anda mungkin tidak memiliki izin untuk menulis ke file ini. Tetap coba izinkan pengeditan?
it: Potresti non avere l'autorizzazione per scrivere in questo file. Consentire comunque la modifica?
ja: このファイルに書き込む権限がない可能性があります。編集の許可を試しますか?
ko: 이 파일에 쓸 권한이 없을 수 있습니다. 그래도 편집 허용을 시도하시겠습니까?
pl: Możesz nie mieć uprawnień do zapisu w tym pliku. Czy mimo to zezwolić na edycję?
pt: Talvez você não tenha permissão para gravar neste arquivo. Tentar permitir a edição mesmo assim?
ro: Este posibil să nu aveți permisiunea de a scrie în acest fișier. Încercați totuși să permiteți editarea?
ru: Возможно, у вас нет разрешения на запись в этот файл. Все равно попытаться разрешить редактирование?
th: คุณอาจไม่มีสิทธิ์เขียนลงในไฟล์นี้ ยังคงลองอนุญาตการแก้ไขหรือไม่
tr: Bu dosyaya yazma izniniz olmayabilir. Yine de düzenlemeye izin vermeyi denemek istiyor musunuz?
uk: Можливо, у вас немає дозволу на запис у цей файл. Усе одно спробувати дозволити редагування?
vi: Có thể bạn không có quyền ghi vào tệp này. Vẫn thử cho phép chỉnh sửa?
zh_hans: 你可能没有写入此文件的权限。仍要尝试允许编辑吗？
zh_hant: 您可能沒有寫入此檔案的權限。仍要嘗試允許編輯嗎？

# ReadOnly_Confirm_SharingViolation
source: Another app has this file open for writing. Allow editing? Changes made by the other app may conflict.
ar: يفتح تطبيق آخر هذا الملف للكتابة. هل تريد السماح بالتحرير؟ قد تتعارض التغييرات التي يجريها التطبيق الآخر.
cs: Jiná aplikace má tento soubor otevřený pro zápis. Povolit úpravy? Změny provedené jinou aplikací mohou být v konfliktu.
de: Eine andere App hat diese Datei zum Schreiben geöffnet. Bearbeitung zulassen? Änderungen der anderen App können zu Konflikten führen.
el: Μια άλλη εφαρμογή έχει ανοιχτό αυτό το αρχείο για εγγραφή. Να επιτρέπεται η επεξεργασία; Οι αλλαγές της άλλης εφαρμογής ενδέχεται να έρθουν σε διένεξη.
es: Otra aplicación tiene este archivo abierto para escritura. ¿Permitir la edición? Los cambios de la otra aplicación pueden entrar en conflicto.
fa: برنامهٔ دیگری این فایل را برای نوشتن باز کرده است. اجازهٔ ویرایش داده شود؟ ممکن است تغییرات برنامهٔ دیگر تداخل پیدا کنند.
fr: Une autre application a ouvert ce fichier en écriture. Autoriser la modification ? Les modifications de l'autre application peuvent entrer en conflit.
hu: Egy másik alkalmazás írásra nyitotta meg ezt a fájlt. Engedélyezi a szerkesztést? A másik alkalmazás módosításai ütközhetnek.
id: Aplikasi lain membuka file ini untuk penulisan. Izinkan pengeditan? Perubahan dari aplikasi lain mungkin bertentangan.
it: Un'altra app ha aperto questo file in scrittura. Consentire la modifica? Le modifiche apportate dall'altra app potrebbero entrare in conflitto.
ja: 他のアプリがこのファイルを書き込みのために開いています。編集を許可しますか? 他のアプリの変更と競合することがあります。
ko: 다른 앱이 쓰기용으로 이 파일을 열어 두었습니다. 편집을 허용하시겠습니까? 다른 앱의 변경 내용과 충돌할 수 있습니다.
pl: Inna aplikacja ma ten plik otwarty do zapisu. Czy zezwolić na edycję? Zmiany wprowadzone przez inną aplikację mogą powodować konflikty.
pt: Outro aplicativo está com este arquivo aberto para gravação. Permitir edição? As alterações feitas pelo outro aplicativo podem entrar em conflito.
ro: Altă aplicație are acest fișier deschis pentru scriere. Permiteți editarea? Modificările făcute de cealaltă aplicație pot intra în conflict.
ru: Другое приложение открыло этот файл для записи. Разрешить редактирование? Изменения другого приложения могут вызвать конфликт.
th: แอปอื่นเปิดไฟล์นี้เพื่อเขียนอยู่ อนุญาตการแก้ไขหรือไม่ การเปลี่ยนแปลงที่ทำโดยแอปอื่นอาจขัดแย้งกัน
tr: Başka bir uygulama bu dosyayı yazmak için açmış. Düzenlemeye izin verilsin mi? Diğer uygulamanın yaptığı değişiklikler çakışabilir.
uk: Інша програма відкрила цей файл для запису. Дозволити редагування? Зміни, внесені іншою програмою, можуть конфліктувати.
vi: Một ứng dụng khác đang mở tệp này để ghi. Cho phép chỉnh sửa? Các thay đổi của ứng dụng kia có thể xung đột.
zh_hans: 另一个应用已以写入方式打开此文件。是否允许编辑？其他应用所做的更改可能会发生冲突。
zh_hant: 另一個應用程式已開啟此檔案以進行寫入。要允許編輯嗎？其他應用程式所做的變更可能會發生衝突。

# ReadOnly_Confirm_Device
source: This allows writing to the device. Nothing is written until you save.
ar: يسمح هذا بالكتابة إلى الجهاز. لن تتم كتابة أي شيء حتى تقوم بالحفظ.
cs: Tímto povolíte zápis do zařízení. Dokud neuložíte, nic se nezapíše.
de: Damit wird das Schreiben auf das Gerät zugelassen. Bis zum Speichern wird nichts geschrieben.
el: Επιτρέπει την εγγραφή στη συσκευή. Δεν γράφεται τίποτα μέχρι να αποθηκεύσετε.
es: Esto permite escribir en el dispositivo. No se escribe nada hasta que guardes.
fa: این کار اجازهٔ نوشتن در دستگاه را می‌دهد. تا زمانی که ذخیره نکنید چیزی نوشته نمی‌شود.
fr: Cela autorise l'écriture sur le périphérique. Rien n'est écrit avant l'enregistrement.
hu: Ez engedélyezi az eszközre írást. Mentésig semmi sem lesz kiírva.
id: Ini mengizinkan penulisan ke perangkat. Tidak ada yang ditulis hingga Anda menyimpan.
it: Consente la scrittura sul dispositivo. Non viene scritto nulla finché non salvi.
ja: このデバイスに書き込めるようにします。保存するまで実際には書き込みません。
ko: 장치에 쓸 수 있게 합니다. 저장하기 전까지는 아무것도 쓰지 않습니다.
pl: To umożliwia zapis na urządzeniu. Nic nie zostanie zapisane, dopóki nie zapiszesz.
pt: Isso permite gravar no dispositivo. Nada é gravado até você salvar.
ro: Aceasta permite scrierea pe dispozitiv. Nu se scrie nimic până la salvare.
ru: Это разрешает запись на устройство. До сохранения ничего не записывается.
th: การดำเนินการนี้อนุญาตให้เขียนลงในอุปกรณ์ จะไม่มีการเขียนใดๆ จนกว่าคุณจะบันทึก
tr: Bu, aygıta yazmaya izin verir. Siz kaydedene kadar hiçbir şey yazılmaz.
uk: Це дозволяє записувати на пристрій. Нічого не буде записано, доки ви не збережете зміни.
vi: Thao tác này cho phép ghi vào thiết bị. Không có gì được ghi cho đến khi bạn lưu.
zh_hans: 这将允许写入该设备。在保存之前不会写入任何内容。
zh_hant: 這會允許寫入裝置。在您儲存之前不會寫入任何內容。

# ReadOnly_CannotRelease_NoWriteTarget
source: This data source can't be written to, so it stays read-only.
ar: لا يمكن الكتابة إلى مصدر البيانات هذا، لذا يظل للقراءة فقط.
cs: Do tohoto zdroje dat nelze zapisovat, proto zůstává jen pro čtení.
de: In diese Datenquelle kann nicht geschrieben werden, daher bleibt sie schreibgeschützt.
el: Δεν είναι δυνατή η εγγραφή σε αυτή την πηγή δεδομένων, επομένως παραμένει μόνο για ανάγνωση.
es: No se puede escribir en este origen de datos, así que sigue siendo de solo lectura.
fa: نوشتن در این منبع داده ممکن نیست، بنابراین فقط خواندنی می‌ماند.
fr: Cette source de données n'est pas accessible en écriture ; elle reste donc en lecture seule.
hu: Ez az adatforrás nem írható, ezért írásvédett marad.
id: Sumber data ini tidak dapat ditulisi, sehingga tetap baca-saja.
it: Non è possibile scrivere in questa origine dati, quindi rimane di sola lettura.
ja: データソースが書き込みに対応していないため、読み取り専用のままです。
ko: 이 데이터 원본에는 쓸 수 없으므로 읽기 전용으로 유지됩니다.
pl: Do tego źródła danych nie można zapisywać, więc pozostaje tylko do odczytu.
pt: Não é possível gravar nesta fonte de dados, por isso ela permanece somente leitura.
ro: În această sursă de date nu se poate scrie, așa că rămâne doar în citire.
ru: В этот источник данных нельзя записывать, поэтому он остается доступным только для чтения.
th: แหล่งข้อมูลนี้ไม่สามารถเขียนได้ จึงยังคงเป็นแบบอ่านอย่างเดียว
tr: Bu veri kaynağına yazılamadığından salt okunur kalır.
uk: У це джерело даних неможливо записувати, тому воно залишається доступним лише для читання.
vi: Không thể ghi vào nguồn dữ liệu này nên tài liệu vẫn ở chế độ chỉ đọc.
zh_hans: 此数据源无法写入，因此保持只读。
zh_hant: 無法寫入此資料來源，因此維持唯讀。

# ReadOnly_CannotRelease_WriteProtectionMode
source: Write protection mode is on, so documents stay read-only.
ar: وضع الحماية من الكتابة قيد التشغيل، لذا تظل المستندات للقراءة فقط.
cs: Je zapnutý režim ochrany proti zápisu, proto dokumenty zůstávají jen pro čtení.
de: Der Schreibschutzmodus ist aktiviert, daher bleiben Dokumente schreibgeschützt.
el: Η λειτουργία προστασίας εγγραφής είναι ενεργή, επομένως τα έγγραφα παραμένουν μόνο για ανάγνωση.
es: El modo de protección contra escritura está activado, así que los documentos siguen siendo de solo lectura.
fa: حالت محافظت از نوشتن روشن است، بنابراین سندها فقط خواندنی می‌مانند.
fr: Le mode de protection en écriture est activé ; les documents restent donc en lecture seule.
hu: Az írásvédelmi mód be van kapcsolva, ezért a dokumentumok írásvédettek maradnak.
id: Mode perlindungan tulis aktif, sehingga dokumen tetap baca-saja.
it: La modalità di protezione da scrittura è attiva, quindi i documenti rimangono di sola lettura.
ja: 書き込み保護モードが有効なため、読み取り専用のままです。
ko: 쓰기 보호 모드가 켜져 있으므로 문서가 읽기 전용으로 유지됩니다.
pl: Tryb ochrony przed zapisem jest włączony, więc dokumenty pozostają tylko do odczytu.
pt: O modo de proteção contra gravação está ativado, por isso os documentos permanecem somente leitura.
ro: Modul de protecție la scriere este activat, așa că documentele rămân doar în citire.
ru: Включен режим защиты от записи, поэтому документы остаются доступными только для чтения.
th: โหมดป้องกันการเขียนเปิดอยู่ เอกสารจึงยังคงเป็นแบบอ่านอย่างเดียว
tr: Yazma koruması modu açık olduğundan belgeler salt okunur kalır.
uk: Увімкнуто режим захисту від запису, тому документи залишаються доступними лише для читання.
vi: Chế độ chống ghi đang bật nên tài liệu vẫn ở chế độ chỉ đọc.
zh_hans: 写保护模式已开启，因此文档保持只读。
zh_hant: 防寫模式已開啟，因此文件維持唯讀。

# ReadOnly_CannotRelease_ReadOnlyMedia
source: The file is on read-only media, so it stays read-only.
ar: الملف موجود على وسائط للقراءة فقط، لذا يظل للقراءة فقط.
cs: Soubor je na médiu jen pro čtení, proto zůstává jen pro čtení.
de: Die Datei befindet sich auf einem schreibgeschützten Medium und bleibt daher schreibgeschützt.
el: Το αρχείο βρίσκεται σε μέσο μόνο για ανάγνωση, επομένως παραμένει μόνο για ανάγνωση.
es: El archivo está en un medio de solo lectura, así que sigue siendo de solo lectura.
fa: فایل روی رسانهٔ فقط خواندنی است، بنابراین فقط خواندنی می‌ماند.
fr: Le fichier se trouve sur un support en lecture seule ; il reste donc en lecture seule.
hu: A fájl írásvédett adathordozón van, ezért írásvédett marad.
id: File berada di media baca-saja, sehingga tetap baca-saja.
it: Il file si trova su un supporto di sola lettura, quindi rimane di sola lettura.
ja: 読み取り専用のメディアにあるため、読み取り専用のままです。
ko: 파일이 읽기 전용 미디어에 있으므로 읽기 전용으로 유지됩니다.
pl: Plik znajduje się na nośniku tylko do odczytu, więc pozostaje tylko do odczytu.
pt: O arquivo está em uma mídia somente leitura, por isso permanece somente leitura.
ro: Fișierul se află pe un suport doar în citire, așa că rămâne doar în citire.
ru: Файл находится на носителе только для чтения, поэтому он остается доступным только для чтения.
th: ไฟล์อยู่บนสื่อแบบอ่านอย่างเดียว จึงยังคงเป็นแบบอ่านอย่างเดียว
tr: Dosya salt okunur bir ortamda olduğundan salt okunur kalır.
uk: Файл розташовано на носії лише для читання, тому він залишається доступним лише для читання.
vi: Tệp nằm trên phương tiện chỉ đọc nên vẫn ở chế độ chỉ đọc.
zh_hans: 该文件位于只读介质上，因此保持只读。
zh_hant: 檔案位於唯讀媒體上，因此維持唯讀。

# Operation_InsertBytes
source: Inserting bytes
ar: إدراج البايتات
cs: Vkládání bajtů
de: Bytes werden eingefügt
el: Εισαγωγή byte
es: Insertando bytes
fa: درج بایت‌ها
fr: Insertion d'octets
hu: Bájtok beszúrása
id: Menyisipkan byte
it: Inserimento di byte
ja: バイトの挿入
ko: 바이트 삽입 중
pl: Wstawianie bajtów
pt: Inserindo bytes
ro: Inserare octeți
ru: Вставка байтов
th: กำลังแทรกไบต์
tr: Baytlar ekleniyor
uk: Вставлення байтів
vi: Đang chèn byte
zh_hans: 正在插入字节
zh_hant: 正在插入位元組

# Operation_Fill
source: Filling
ar: التعبئة
cs: Vyplňování
de: Wird gefüllt
el: Συμπλήρωση
es: Rellenando
fa: پر کردن
fr: Remplissage
hu: Kitöltés
id: Mengisi
it: Riempimento
ja: 塗りつぶし
ko: 채우는 중
pl: Wypełnianie
pt: Preenchendo
ro: Umplere
ru: Заполнение
th: กำลังเติม
tr: Dolduruluyor
uk: Заповнення
vi: Đang điền
zh_hans: 正在填充
zh_hant: 正在填滿

# Operation_Resize
source: Changing the file size
ar: تغيير حجم الملف
cs: Změna velikosti souboru
de: Dateigröße wird geändert
el: Αλλαγή μεγέθους αρχείου
es: Cambiando el tamaño del archivo
fa: تغییر اندازهٔ فایل
fr: Modification de la taille du fichier
hu: Fájlméret módosítása
id: Mengubah ukuran file
it: Modifica della dimensione del file
ja: ファイルサイズの変更
ko: 파일 크기 변경 중
pl: Zmiana rozmiaru pliku
pt: Alterando o tamanho do arquivo
ro: Modificare dimensiune fișier
ru: Изменение размера файла
th: กำลังเปลี่ยนขนาดไฟล์
tr: Dosya boyutu değiştiriliyor
uk: Зміна розміру файлу
vi: Đang đổi kích thước tệp
zh_hans: 正在更改文件大小
zh_hant: 正在變更檔案大小
